#include <bits/stdc++.h>
using namespace std;

int main(void) {
    ios::sync_with_stdio(0);
    cin.tie(0);

}
/*
# 집중하자.

혼자 알고리즘을 공부할 때는 항상 핸드폰을 끄고 초집중해서 공부를 하시는 것을
추천드립니다. 또한 하루 3 ~ 4시간 이상은 하셔야 실력이 늡니다. 다음은 푸는 방법입니다.

1. 고민 : 1 ~ 2시간 이내
2. 문제풀이
3. 답지 보며 자신의 코드와 비교
4. 만약 틀릴 경우 일주일 내내 틀린 문제를 처음부터 다시 풀기(이 문제를 처음 봤을 때
30분내에 풀정도로)

# 다양하게 풀 수 없을까?

다양하게 풀 생각을 해야 합니다. 어떠한 문제를 예를 들어 void형 함수를 구현해서
풀었다고 해봅시다. 그 다음에는 int형으로 구현을 하거나 vector<int> 형을 리턴하는 함수
등 어떠한 것을 다양하게 리턴하는 함수로 만들어서 푸는 훈련 또한 진행하셔야 합니다.

# 손코딩하라.
손코딩은 필수입니다. 어느정도 난이도의 문제는 손코딩을 하지 않고 풀 수도 있겠지만 먼저
이렇게 풀겠다 감을 잡고 들어가는데 있어서 손코딩을 하시는 게 좋습니다. 또한 문제를
만약에 못 풀었을경우에도 손코딩으로 복습하는것도 추천드립니다. 손코딩이라는 것은 별거
아닙니다. 자신이 이해하는 수준으로 코드를 손으로 쓰는 것을 말합니다. 앞의 그림처럼 저가
같은 경우는 for반복문을 for i = 0 -> n 이런식으로 표시해서 코딩을 합니다. “자신이
알아들을 수 있는” 방법으로 하시면 됩니다.
이렇게 알고리즘 용 C++의 기초를 다뤄보았습니다. 코테 말고도 만약 면접을 본다면
정렬알고리즘 정도는 외워야 합니다. 다음 링크를 추천합니다.

- 정렬알고리즘 정리 : https://blog.naver.com/jhc9639/221338179774
*/