#include <bits/stdc++.h>
using namespace std;

int main(void) {
    ios::sync_with_stdio(0);
    cin.tie(0);

    /*
빠른 속도로 코딩하자

코딩테스트에서 중요한 것 중 하나는 속도입니다. 코드를 구축할 때는 간단하고 빠르게 짜야합니다.

실제로 제가 아는 네이버 개발자의 경우 코딩테스트를 10분안에 모두풀고 제출했고 ( All solved ) 이 기록을 기반으로 면접관들이 지인을 좋게 봐서 합격했다고 합니다. 합격한 뒤에도 정말 10분안에 푼거 맞냐고 경이롭다는 식으로 물어볼정도로 코테를 다 푸는 실력이라면 속도도 중요하다는 것입니다.

저같은 경우도 네이버 면접을 볼 때 라이브코딩테스트 - DP문제를 면접관이 준비해쏙 3분안에 해당 문제를 풀었고 해당 면접관이 좋게 봐서 합격했던 기억이 있습니다.

이렇게 빠르게 코딩테스트를 보려면 빠르게 문제지문을 해석하는 실력, 정확도, 유연하고 빠른 사고력, 그리고 여기서 말한 타자속도 또한 중요합니다.

아래의 사이트로 가면 타이핑을 연습할 수 있습니다.
https://www.typingtest.com/
참고로 필자의 타이핑 실력은 52wpm입니다. 45이상이 되도록 연습해봅시다.

-------------------------------------------------------------------------------

이정도 숫자는 외우자

시간복잡도를 어림잡아 계산할 때 나오는 수들. 이정도는 외워줍시다.

- 10! = 3628800
- 2^10 = 1024
- 3^10 = 59049

외울 때 그냥 10!은 360만, 3&10은 6만정도… 이렇게 외우면 됩니다.
    */
}